[
    {
        "joke": "Did I tell you the one about the plane?  Nevermind, it would probaby go over your head", 
        "tags": [
            "plane", 
            "planes"
        ]
    }, 
    {
        "joke": "I want to die peacefully, like my grandfather.  Not screaming at yelling, like the passengers in his car.", 
        "tags": [
            "car", 
            "accident"
        ]
    }, 
    {
        "joke": "FIFTY ON RED'S AWFUL INTERNET LOLLLL", 
        "tags": [
            "annoying", 
            "internet", 
            "50onred", 
            "awful", 
            "miserable", 
            "pathetic", 
            "neigh-incomprehensibly-bad", 
            "disasterous"
        ]
    }, 
    {
        "joke": "Why did the scientist install a knocker on his door?  He wanted to win the no-bell prize!", 
        "tags": [
            "knock"
        ]
    }, 
    {
        "joke": "I shot my first turkey today.  It scared the heck out of everyone in the frozen food section, but boy was it a rush!", 
        "tags": [
            "turkey"
        ]
    }, 
    {
        "joke": "My buddy just updated his facebook status to 'I love my girlfriend <3'.  I mean, I knew he liked them young, but that's just ridiculous.", 
        "tags": [
            "girlfriend"
        ]
    }, 
    {
        "joke": "Tim is super cool.  That was not a joke.", 
        "tags": [
            "intern"
        ]
    }, 
    {
        "joke": "How do you make a blonde laugh on Sunday?  Tell her a joke on Friday!", 
        "tags": [
            "blond", 
            "blonde"
        ]
    }, 
    {
        "joke": "Jesus said to John, 'Come forth and I will give you eternal life!'.  But John came fifth and got a toaster", 
        "tags": [
            "toaster", 
            "Jesus"
        ]
    }, 
    {
        "joke": "There was a man who entered a local paper's pun contest.. He sent in ten different puns, in the hope that at least one of the puns would win. Unfortunately, no pun in ten did.", 
        "tags": [
            "pun", 
            "contest", 
            "intended"
        ]
    }, 
    {
        "joke": "Did you hear about the kidnapping in Camden?  Don't worry, the kid woke up.", 
        "tags": [
            "kidnap", 
            "kidnapping"
        ]
    }, 
    {
        "joke": "I cleaned the attic with the wife the other day. Now I can't get the cobwebs out of her hair.", 
        "tags": [
            "wife", 
            "attic", 
            "cobwebs", 
            "spiderweb"
        ]
    }, 
    {
        "joke": "I went to buy some camouflage trousers the other day but I couldn't find any.", 
        "tags": [
            "trousers", 
            "pants", 
            "camouflage", 
            "camoflage", 
            "camo"
        ]
    }, 
    {
        "joke": "A group of chess enthusiasts checked into a hotel and were standing in the lobby discussing their recent tournament victories. After about an hour, the manager came out of the office and asked them to disperse. ''But why?'' they asked, as they moved off. ''because,'' he said ''I can't stand chess nuts boasting in an open foyer.''", 
        "tags": [
            "chess", 
            "hotel", 
            "chestnut", 
            "chestnuts", 
            "foyer"
        ]
    }, 
    {
        "joke": "What do you call a man who never farts in public?  A private tutor!", 
        "tags": [
            "fart", 
            "tutor"
        ]
    }, 
    {
        "joke": "What do you call a nun in a wheelchair?  Virgin mobile", 
        "tags": [
            "nun"
        ]
    }, 
    {
        "joke": "It's a bad idea to eat meat from female cows.  That would be a Miss Steak.", 
        "tags": [
            "cow", 
            "beef"
        ]
    }, 
    {
        "joke": "Did you hear about the woman who got breast implants with all these sticks and twigs and stuff?  This isn't actually a joke, but it sure would be funny if it had a punchline, wooden tit?", 
        "tags": [
            "tit", 
            "tits", 
            "stick"
        ]
    }, 
    {
        "joke": "I went to the barber for a haircut and at first I thought he did an awful job, but now it's growing on me.", 
        "tags": [
            "barber"
        ]
    }, 
    {
        "joke": " i saw a guy today with soot all over his face carrying a large pick axe and wearing a royal blue hardhat that matched his overalls.  but those are just miner details.", 
        "tags": [
            " miner", 
            "pun"
        ]
    }, 
    {
        "joke": "My mother-in-law fell down a wishing well, I was amazed, I never knew they worked.", 
        "tags": [
            "in-law", 
            "in-laws", 
            "wish", 
            "well", 
            "wishing"
        ]
    }, 
    {
        "joke": "How does NASA throw consistently mega-awesome parties?  They always planet.", 
        "tags": [
            "NASA", 
            "planet"
        ]
    }, 
    {
        "joke": "Why do seagulls live at the sea?  Because if they lived at the bay, they'd be bagels!!!", 
        "tags": [
            "seagull", 
            "bagels", 
            "bagel"
        ]
    }, 
    {
        "joke": "Remember that personal trainer I was dating?  Well, I had to dump her, because we just weren't working out", 
        "tags": [
            "exercise", 
            "gym"
        ]
    }, 
    {
        "joke": "when tempted to fight fire with fire, remember that the fire department are trained professionals, and they usually use water", 
        "tags": [
            "fire"
        ]
    }, 
    {
        "joke": "I got a haircut and I thought it was pretty awful, but it's okay.  It's growing on me.", 
        "tags": [
            "haircut"
        ]
    }, 
    {
        "joke": "What did the skeleton say when he went into the bar?  'Get me a beer and a mop!'", 
        "tags": [
            "skeleton"
        ]
    }, 
    {
        "joke": "What did the suicide-bomber instructor say to his students?  Pay attention!  I'm only going to show you this once", 
        "tags": [
            "terrorist"
        ]
    }, 
    {
        "joke": "Knock knock.           --Who's there?       \n  (waiting)       \n                                                                                                   (waiting)                                                                                        (waiting)                                                                         (waiting)                                                                                                                                                                     (waiting)                                                                                    --Java.", 
        "tags": [
            "java"
        ]
    }, 
    {
        "joke": "What do hackers do when they go on vacation? They go phishing!", 
        "tags": [
            "hacker"
        ]
    }, 
    {
        "joke": "A woman gets on a bus with her baby. The bus driver says: ''Ugh, that's the ugliest baby I've ever seen!'' The woman walks to the rear of the bus and sits down, fuming. She says to a man next to her: ''The driver just insulted me!'' The man says: ''You go up there and tell him off. Go on, I'll hold your monkey for you.''", 
        "tags": [
            "monkey", 
            "baby", 
            "bus", 
            "ugly"
        ]
    }, 
    {
        "joke": "Sometimes I feel like I have so much debt that I could start a government", 
        "tags": [
            "debt"
        ]
    }, 
    {
        "joke": "'I said to the Gym instructor 'Can you teach me to do the splits?'' He said, ''How flexible are you?'' I said, ''I can't make Tuesdays'", 
        "tags": [
            "gym", 
            "split", 
            "splits", 
            "flexible", 
            "Tuesday", 
            "Tuesdays"
        ]
    }, 
    {
        "joke": "A man walked passed an insane asylum. He hears voices on the inside chanting 'thirteen,thirteen, thirteen'. He is curious why they are chanting that. He looks around and finds a hole that allows himself to look inside the fence. As he puts his eye on the hole a stick jabs him in the eye. And the chant changes to 'fourteen, fourteen, fourteen'.", 
        "tags": [
            "insane", 
            "asylum"
        ]
    }, 
    {
        "joke": "There was a blonde, a redhead, and a brunette. They were all trapped on an island and the nearest shore was 50 miles away. The redhead swam trying to make it to the other shore she swam 15 miles, drowned, and died. The brunette swam 24 miles, drowned, and died. The blonde swam 25 miles, got tired, and swam back.", 
        "tags": [
            "swim", 
            "swimming"
        ]
    }, 
    {
        "joke": "Why did the bee get married?  Because he found his honey", 
        "tags": [
            "bee"
        ]
    }, 
    {
        "joke": "I tried water polo but my horse drowned", 
        "tags": [
            "water", 
            "polo", 
            "horse", 
            "drown", 
            "drowned"
        ]
    }, 
    {
        "joke": "A guy took his blonde girlfriend to her first football game. They had great seats right behind their team's bench. After the game, he asked her how she liked the experience. 'Oh, I really liked it,'' she replied, 'especially the tight pants and all the big muscles, but I just couldn't understand why they were killing each other over 25 cents.' Dumbfounded, her date asked, 'What do you mean?' 'Well, they flipped a coin, one team got it, and then for the rest of the game, all they kept screaming was, 'Get the quarterback! Get the quarterback!' I'm like, hello? It's only 25 cents!", 
        "tags": [
            "football"
        ]
    }, 
    {
        "joke": "What does the most interesting man in the world eat for breakfast?  Dos Eggies", 
        "tags": [
            "Egg", 
            "Eggs", 
            "Equis"
        ]
    }, 
    {
        "joke": "What did the engineers say to the crew of astronauts after they discovered they didnt install the rockets correctly?  'Guys, we really Apollo-gize'", 
        "tags": [
            "space"
        ]
    }, 
    {
        "joke": "I went down the local supermarket, I said, ''I want to make a complaint, this vinegar's got lumps in it'', he said, 'those are pickled onions'", 
        "tags": [
            "onions", 
            "supermarket", 
            "vinegar", 
            "pickles"
        ]
    }, 
    {
        "joke": "So I went to the Chinese restaurant and this duck came up to me with a red rose and says ''Your eyes sparkle like diamonds''. I said, ''Waiter, I asked for a-ROMATIC duck''", 
        "tags": [
            "duck", 
            "Chinese", 
            "chinese", 
            "aromatic", 
            "romantic"
        ]
    }, 
    {
        "joke": " \ndoctor, in the delivery room: i have some bad news and some worse news.\npatient, after giving birth: ok, well... give me the bad news first.\ndoctor: you gave birth to a 10 lb. eyeball.\npatient: an eyeball? what could be worse?\ndoctor: it's blind.", 
        "tags": [
            "eyeball", 
            "eyeballs", 
            "baby", 
            "birth", 
            "badnews"
        ]
    }, 
    {
        "joke": "Why would someone drive two cars?  Because he has two feet.  -- Tim", 
        "tags": [
            "tim"
        ]
    }, 
    {
        "joke": "I bought some shoes off a drug dealer.  I don't know what he laced them with, but I've been tripping all day!", 
        "tags": [
            "drug", 
            "drugs"
        ]
    }, 
    {
        "joke": "What did one ocean say to the other?  Nothing, they just waved", 
        "tags": [
            "ocean", 
            "wave"
        ]
    }, 
    {
        "joke": "A seal walks into a club....", 
        "tags": [
            "seal", 
            "club", 
            "hilarious"
        ]
    }, 
    {
        "joke": "What do you call a boomerang that doesn't come back?  A stick.", 
        "tags": [
            "boomerang"
        ]
    }, 
    {
        "joke": "A man buys a lie detector robot that slaps people who lie. So he decides to try it out at dinner. \n DAD: Son, where were you today during school? \n SON: At school \n*SLAP* robot slaps son \nSON: Ok, I went to the movies. \nDAD: Which one? \nSON: Toy Story \n*SLAP* robot slaps son again \nSON: Ok, it was A Day with a Porn Star. \nDAD: WHAT?! When I was your age, I didn't even know what porn was. \n*SLAPI* Robot slaps dad \nMOM: HAHA!! After all he is your son! \n*SLAP* Robot slaps mom", 
        "tags": [
            "robot", 
            "lie"
        ]
    }, 
    {
        "joke": "Did I tell you the one about the Maize?  Nevermind, it's too corny", 
        "tags": [
            "corn"
        ]
    }, 
    {
        "joke": "A man kills a deer and takes it home to cook for dinner. Both he and his wife decide that they won't tell the kids what kind of meat it is, but will give them a clue and let them guess. The dad said, 'Well it's what Mommy calls me sometimes.'' The little girl screamed to her brother, 'Don't eat it. Its an asshole!", 
        "tags": [
            "deer", 
            "dear"
        ]
    }, 
    {
        "joke": "I slept like a log last night... and woke up in the fireplace this morning", 
        "tags": [
            "log", 
            "fireplace", 
            "sleep", 
            "slept"
        ]
    }, 
    {
        "joke": "A woman has twins, and gives them up for adoption. One of them goes to a family in Egypt and is named 'Amal.' The other goes to a family in Spain, they name him Juan'. Years later; Juan sends a picture of himself to his mum. Upon receiving the picture, she tells her husband that she wished she also had a picture of Amal. Her husband responds, ''But they are twins. If you've seen Juan, you've seen Amal.''", 
        "tags": [
            "Egyptian", 
            "Juan", 
            "twins", 
            "twin"
        ]
    }, 
    {
        "joke": "Did you know that camels need sex more than water?  They can go for two weeks without water, but not a single day without a hump!", 
        "tags": [
            "camel", 
            "hump"
        ]
    }, 
    {
        "joke": "I'll tell you what I love doing more than anything: trying to pack myself in a small suitcase. I can hardly contain myself.", 
        "tags": [
            "suitcase", 
            "contain", 
            "pack"
        ]
    }, 
    {
        "joke": "Why don't ants go to churches?  Because they are in sects!", 
        "tags": [
            "ant", 
            "ants"
        ]
    }, 
    {
        "joke": "I got home last night and was absolutely delighted to discover that someone had stolen every lamp in the house", 
        "tags": [
            "delight", 
            "delighted", 
            "lamp"
        ]
    }, 
    {
        "joke": "Did you hear about the man who got his entire left side amputated?  Don't worry, I heard he's all right now.", 
        "tags": [
            "left"
        ]
    }, 
    {
        "joke": "I went to the zoo the other day, there was only one dog in it, it was a shitzu.", 
        "tags": [
            "shitzu", 
            "zoo", 
            "dog"
        ]
    }, 
    {
        "joke": "Four fonts walk into a bar the barman says ''Oi - get out! We don't want your type in here''", 
        "tags": [
            "font", 
            "fonts", 
            "type"
        ]
    }, 
    {
        "joke": " one day a man goes to a pet shop to buy a parrot. the assistant takes the man to the parrot section and asks the man to choose one. the man asks, ''how much is the yellow one?''\nthe assistant says, ''$2000.'' the man is shocked and asks the assistant why it's so expensive. the assistant explains, ''this parrot is a very special one. he knows typewriting and can type really fast.''\n''what about the green one?'' the man asks.\nthe assistant says, ''he costs $5000 because he knows typewriting and can answer incoming telephone calls and takes notes.''\n''what about the red one?'' the man asks.\nthe assistant says, ''that one's $10,000.''\nthe man says, ''what does he do?''\nthe assistant says, ''i don't know, but the other two call him boss.\"", 
        "tags": [
            "parrot", 
            "boss", 
            "yellow", 
            "red", 
            "green"
        ]
    }, 
    {
        "joke": " how do you drown a blonde?  put a scratch-and-sniff at the bottom of a pool!", 
        "tags": [
            "blonde", 
            "drown", 
            "drowning", 
            "pool", 
            "scratch-and-sniff"
        ]
    }, 
    {
        "joke": " How many hipsters does it take to screw in a lightbulb?   \n\n...oh, it's a really obscure number.  You've probably never heard of it.", 
        "tags": [
            "filthy", 
            "hipsters", 
            "filthy-hipsters", 
            "obscure"
        ]
    }, 
    {
        "joke": " Q. What should you do to a red elephant? A. Quit telling it dirty jokes.", 
        "tags": [
            "embarrassed", 
            "elephant"
        ]
    }, 
    {
        "joke": "  I found out the real reason I'm always so tired: because I’m overworked. The population of this country is 300 million. 124 million are retired and 21 million are babies or too young. That leaves 155 million to do the work. There are 95 million in school, which leaves 60 million to do the work. Of this there are 31 million employed by the federal government, leaving 29 million to do the work. 4.8 million are in the Armed Forces, which leaves 24.2 million to do the work. Take from the total the 20,800,000 people who work for State and City Governments and that leaves 3.4 million to do the work. At any given time there are 688,000 people in hospitals, leaving 2,712,000 to do the work. Now, there are 2,711,998 people in prisons. That leaves just two people to do the work. You and me. And you’re sitting at your computer reading jokes!", 
        "tags": [
            "work", 
            "government", 
            "lazy", 
            "goof-off", 
            "not-fair"
        ]
    }, 
    {
        "joke": " Did you hear about the guy whose whole left side was cut off? He's all right now.", 
        "tags": [
            "cut"
        ]
    }, 
    {
        "joke": "  Why are New Yorkers so depressed?\n\n...because the light at the end of the tunnel is New Jersey", 
        "tags": [
            "York", 
            "Jersey", 
            "tunnel", 
            "depressing", 
            "depressed"
        ]
    }, 
    {
        "joke": " Two elderly men are talking while thier wives prepare supper.\nThe first man says \"we went to this really amazing restaurant the other day, you have to try it.\"\nThe second replies \"we would love to, what is it called? \"\nAfter a long pause the first man, clearly confused, asks \"what is the name of the flower. . .The one with the thorns on it? \"\nThe second replies \" a rose? \"\n\"Yes, thank you\" says the first man as he turns to the kitchen and yells \"ROSE ! WHAT'S THE NAME OF THAT RESTAURANT WE WENT TO THE OTHER DAY ? \"", 
        "tags": [
            "rose", 
            "restaurant", 
            "old"
        ]
    }, 
    {
        "joke": " There are these two farmers who grew up together.  Years later, they are both very successful, married and own their own farms. The first farmer decides to pay his friend a visit, but as he he drives up, he see his friend over by the barn balls deep in the muffler of his John Deer. Really going at it. Confused, the first farmer quickly turns around and drives off.\nLater that night he tells his wife what he saw and says, \"I just don't know. I've known him all these years and this is just... so out of character for him. I mean, I know he's not the brightest bulb in the box but this is just strange.\"\nHis wife says, \"Well maybe its not as serious as you think. Why don't you just ask him about it over a few drinks?\"\nSo the farmer calls his friend and after a few beers he says \"Listen man. The other day I came by your house and saw you having sex with your tractor and just wanted to find out whats going on.\"\nThe second farmer hangs his head and says, \"Well, I didn't want to tell you but me and the old lady ain't doing so hot. We fight all the time and we never have sex. So she thought it be a good idea to see one of those fancy couple's counselors. And he told me that when things get bad, and my wife isn't responding in bed, I have to \"do something sexy to a tractor.\"", 
        "tags": [
            "farmer", 
            "farmers", 
            "tractor", 
            "couples", 
            "counseling"
        ]
    } 
]
